# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\tmj32\Documents\TCNJ\Senior_Project\Oscilloscope_Senior_Project\tcom_engineering\embed_sw\tcom_app\tcom_app_psoc6_lvgl6\tcom_displ_test_psoc6.cydsn\tcom_displ_test_psoc6.cyprj
# Date: Fri, 30 Apr 2021 19:10:08 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyPLL0} -period 7.4999999999999991 -waveform {0 3.75} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyClk_HF0} -period 7.4999999999999991 -waveform {0 3.75} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 7.4999999999999991 -waveform {0 3.75} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 14.999999999999998 -waveform {0 7.5} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {CyClk_PumpPeri} -source [get_pins {ClockBlock/periclk}] -edges {1 3 7} -nominal_period 44.999999999999993 [list [get_pins {ClockBlock/ff_div_48}]]
create_generated_clock -name {CLOCK_2} -source [get_pins {ClockBlock/periclk}] -edges {1 67 135} [list [get_pins {ClockBlock/ff_div_11}]]
create_generated_clock -name {I2C_MASTER_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 43 87} -nominal_period 644.99999999999989 [list [get_pins {ClockBlock/ff_div_2}]]
create_generated_clock -name {SPIM_SCBCLK} -source [get_pins {ClockBlock/periclk}] -edges {1 3 5} -nominal_period 29.999999999999993 [list [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {CyPeriClk_App} -period 14.999999999999998 -waveform {0 7.5} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\tmj32\Documents\TCNJ\Senior_Project\Oscilloscope_Senior_Project\tcom_engineering\embed_sw\tcom_app\tcom_app_psoc6_lvgl6\tcom_displ_test_psoc6.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\tmj32\Documents\TCNJ\Senior_Project\Oscilloscope_Senior_Project\tcom_engineering\embed_sw\tcom_app\tcom_app_psoc6_lvgl6\tcom_displ_test_psoc6.cydsn\tcom_displ_test_psoc6.cyprj
# Date: Fri, 30 Apr 2021 19:09:46 GMT
# LCD_INTERFACE
# False paths present for both 8 and 16 bits Graphic LCD Interface configurations 
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_0}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_0}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_0}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_0}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_1}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_1}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_1}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_1}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_2}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_2}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_2}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_2}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_3}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_3}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_3}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_3}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_4}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_4}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_4}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_4}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_5}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_5}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_5}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_5}]]} 
   
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_6}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_6}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_6}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_6}]]} 
 
expr {(8) == 8 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd8:Lsb\/p_out_7}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_7}]] : \
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Lsb\/p_out_7}] -to [get_pins {\LCD_INTERFACE:LsbReg\/status_7}]]} 
   
# False paths present only for 16 bits Graphic LCD Interface configuration
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_0}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_0}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_1}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_1}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_2}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_2}]] : {}}

expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_3}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_3}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_4}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_4}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_5}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_5}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_6}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_6}]] : {}}
   
expr {(8) == 16 ?
   [set_false_path -from [get_pins {\LCD_INTERFACE:GraphLcd16:Msb\/p_out_7}] -to [get_pins {\LCD_INTERFACE:GraphLcd16:MsbReg\/status_7}]] : {}}

